Config/DataProcessors/ФормированиеБухгалтерскихПроводок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеБухгалтерскихПроводок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияИзменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьВалютныеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияПроведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВалютныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУчетПоИФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВалютаВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКурсКратностьВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИФОШапки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокИсправленияОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявительОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыявительОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/ФормированиеБухгалтерскихПроводок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует таблицу проводок документа. Типовая операция и дополнительные
// реквизиты должны быть записаны в регистры. В случае возникновения ошибок возвращает
// Неопределено.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка - документ, для которого формируем проводки
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица проводок для загрузки в набор записей регистра бухгалтерии.
//
Функция СформироватьТаблицуПроводок(ДокументСсылка) Экспорт

	ТиповаяОперация = БухгалтерскиеОперацииСервер.БухгалтерскаяОперацияДокумента(ДокументСсылка);
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРеквизитов = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация);
	ИменаРеквизитов = СтрСоединить(ТаблицаРеквизитов.ВыгрузитьКолонку("ИмяДляФормулы"),",");
	ИменаРеквизитов = ИменаРеквизитов + ",Курс,Кратность";
	
	ЗначенияДопРеквизитов = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ДокументСсылка, ИменаРеквизитов);
	
	ОбработкаОбъект = Обработки.ФормированиеБухгалтерскихПроводок.Создать();
	ОбработкаОбъект.ДокументОснование = ДокументСсылка;
	ОбработкаОбъект.ТиповаяОперация = ТиповаяОперация;
	
	ПараметрыФормированияПроводок = ОбработкаОбъект.ПараметрыАвтоФормированияПроводок();
	ПараметрыФормированияПроводок.ТекущийОбъект = ДокументСсылка.ПолучитьОбъект();
	ПараметрыФормированияПроводок.ДопРеквизиты = ЗначенияДопРеквизитов;
	
	Отказ = Ложь;
	ОбработкаОбъект.АвтоФормированиеПроводок(ПараметрыФормированияПроводок, Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыФормированияПроводок.ТаблицаПроводок;

КонецФункции // СформироватьТаблицуПроводок()

#КонецОбласти

#КонецЕсли
